<?php # $Id$

/**
 *  @version $Revision$
 *  @author Ivan Cenov jwalker@hotmail.bg
 *  EN-Revision: 1.3
 */

@define('PLUGIN_EVENT_CACHESIMPLE_NAME',    'Просто кеширане на страници');
@define('PLUGIN_EVENT_CACHESIMPLE_DESC',    '[ЕКСПЕРИМЕНТАЛЕН СТАДИЙ] Кешира/пре-генерира страници. Забележка: Пречи на динамичните възможности на блога и може да не работи добре с динамичните приставки. За сметка на това предоставя скорост, ако не блогът не зависи от динамика в реално време.  (Този плъгин трябва да бъде поставен колкото може по-напред в списъка на събитийните приставки. Само динамични приставки като karmavoting трябва да бъдат позиционирани преди тази приставка.)');
@define('PLUGIN_EVENT_CACHESIMPLE_BROWSER', 'Отделни кеширане за Internet Explorer и Mozilla браузъри ?');
@define('PLUGIN_EVENT_CACHESIMPLE_KEEPFRESH', 'Форсиране на поддръжка на свежи копия?');
@define('PLUGIN_EVENT_CACHESIMPLE_KEEPFRESH_DESC', 'Не се изпраща "Expires" хедър, което предизвиква клиентите да не кешират локално страниците локално. Това ще накара клиентите да правят заявки към сървъра всеки път, когато страниците се заявяват от потребителя. Ако клиентите са "коректни" те ще използват "валидиращи" техники за минимизиране на трансфера на цели страници. Това ще премахне проблемите, когато коментарите не се появяват, след като са записани, но ще намали скоростта на достъпа до блога.');
