<?php

/**
 *  @version 
 *  @author Ivan Cenov jwalker@hotmail.bg
 *  EN-Revision: 1.3
 */
 
@define('PLUGIN_EVENT_OUTDATE', 'Скриване на статии от нерегистрирани посетители на блога');
@define('PLUGIN_EVENT_OUTDATE_DESC', 'Скрива всички статии, които са по-стари от определена възраст, така че те да бъдат виждани само от регистирани посетители и автори');
@define('PLUGIN_EVENT_OUTDATE_TIMEOUT', 'Максимална възраст на статиите преди те да бъдат скрити ?');
@define('PLUGIN_EVENT_OUTDATE_TIMEOUT_DESC', 'Въведете максималната възраст на статиите (брой дни), след която те се скриват. Стойност нула деактивира функцията.');
@define('PLUGIN_EVENT_OUTDATE_TIMEOUT_STICKY', 'Максимална възраст на фиксираните статии преди те да бъдат направени обикновени ?');
@define('PLUGIN_EVENT_OUTDATE_TIMEOUT_STICKY_DESC', 'Въведете максималната възраст на фискираните статии (брой дни), след която те стават обикновени. Стойност нула деактивира функцията.');

@define('PLUGIN_EVENT_OUTDATE_TIMEOUT_EXPIRY', 'Поле за крайна дата');
@define('PLUGIN_EVENT_OUTDATE_TIMEOUT_EXPIRY_FIELD', 'Ако използвате приставката "Допълнителни свойства на статиите" можете да дефинирате поле, където да укажете дата, на която статията да престане да е активна. Датата трябва да бъде форматирана така: YYYY-MM-DD. Тази приставка ще следи за настъпване на датата и ще постави статията в състояние на чернова, така че тя няма да се вижда. Въведете името на полето за датата тук (например "ExpiryDate" или "КраенСрок") тук.');
